[
  {
    "name": "Beef, black-eyed bean and plantain hotpot",
    "tags": ["dinner"],
    "ingredients": ["350g/12oz dried black-eyed beans","900g/2lb sirloin steak, cut into 1cm/½ in cubes","325ml/11½fl oz vegetable oil","1 large onion, chopped","4 garlic cloves, finely chopped","4cm/2in piece fresh root ginger, grated","1 tsp dried chilli flakes","2 x 400g tins chopped tomatoes","2 tbsp tomato purée","2 beef stock cubes","2 sprigs fresh thyme","1 Scotch bonnet chilli, chopped","3 ripe plantain, peeled and sliced","salt and freshly ground black pepper"],
    "recipe": "1. Cook the dried beans in a large pan of boiling water for about 20 minutes until softened. Drain and set aside.\n2. Heat 2 tablespoons of the oil in a large casserole dish and brown the beef on all sides over a medium heat. Remove and set aside.\n3. Heat 100ml/3½fl oz oil in the same pan and fry the onions for 2–3 minutes, until slightly softened. Add the garlic, ginger and dried chilli flakes and stir. Add the tinned tomatoes, tomato purée, stock cubes, thyme and Scotch bonnet chillies and season with salt and pepper. Cook the tomatoes for 10 minutes before adding the beef and beans and cooking on low for 45–60 minutes, stirring occasionally.\n4. While the stew cooks, heat the remaining oil in a deep frying pan and shallow fry the plantain slices in batches for 2–3 on each side until golden-brown. Transfer to a plate lined with kitchen paper to drain. Top the stew with the plantains before serving.",
    "photo": "https://ichef.bbci.co.uk/food/ic/food_16x9_1600/recipes/beef_black-eyed-bean_and_85011_16x9.jpg",
    "isVegan": false,
    "isVegetarian": false,
    "preparationTime": 45,
    "cookingTime": 90,
    "createdOn": "2021-09-15",
    "cuisineId": "african"
  },
  {
    "name": "Moroccan-style roasted veg",
    "tags": ["traybake", "lunch", "easy"],
    "ingredients": ["2 large red or orange peppers, de-seeded and cut into bite-sized chunks","2 sweet potatoes, scrubbed and cut into bite-sized chunks","2 red onions, cut into bite-sized chunks","200g/7oz cherry tomatoes","1 tbsp harissa spice mix","1 tbsp olive oil","sea salt and freshly ground black pepper"],
    "recipe": "1. Preheat the oven to 220C/200C Fan/Gas 7.\n2. Put the peppers, sweet potatoes, red onions, whole cherry tomatoes, harissa spice mix, oil and a generous amount of salt and pepper on a large baking sheet. Toss well. \n3. Roast for 30 minutes, or until everything is soft and charred, tossing the tray halfway through. ",
    "photo": "https://ichef.bbci.co.uk/food/ic/food_16x9_1600/recipes/5-ingredient_33925_16x9.jpg",
    "isVegan": true,
    "isVegetarian": true,
    "preparationTime": 25,
    "cookingTime": 45,
    "createdOn": "2021-12-17",
    "cuisineId": "african"
  },
  {
    "name": "Vegan pancakes",
    "tags": ["breakfast", "sweet"],
    "ingredients": ["125g/4½oz self-raising flour","2 tbsp caster sugar","1 tsp baking powder","good pinch sea salt","150ml/5fl oz soya milk or almond milk","¼ tsp vanilla extract","4 tsp sunflower oil, for frying"],
    "recipe": "1. Put the flour, sugar, baking powder and salt in a bowl and mix thoroughly. Add the milk and vanilla extract and mix with a whisk until smooth. \n2. Place a large non-stick frying pan over a medium heat. Add 2 teaspoons of the oil and wipe around the pan with a heatproof brush or carefully using a thick wad of kitchen paper. \n3. Once the pan is hot, pour a small ladleful (around two dessert spoons) of the batter into one side of the pan and spread with the back of the spoon until around 10cm/4in in diameter. Make a second pancake in exactly the same way, greasing the pan with the remaining oil before adding the batter.\n4. Cook for about a minute, or until bubbles are popping on the surface and just the edges look dry and slightly shiny. Quickly and carefully flip over and cook on the other side for a further minute, or until light, fluffy and pale golden brown. If you turn the pancakes too late, they will be too set to rise evenly. You can always flip again if you need the first side to go a little browner. \n5. Transfer to a plate and keep warm in a single layer (so they don’t get squished) on a baking tray in a low oven while the rest of the pancakes are cooked in exactly the same way. Serve with your preferred toppings. ",
    "photo": "https://ichef.bbci.co.uk/food/ic/food_16x9_1600/recipes/vegan_american_pancakes_76094_16x9.jpg",
    "isVegan": true,
    "isVegetarian": true,
    "preparationTime": 25,
    "cookingTime": 20,
    "createdOn": "2021-09-15",
    "cuisineId": "american"
  },
  {
    "name": "Smoky macaroni cheese",
    "tags": ["dinner"],
    "ingredients": ["750ml/1¼ pint milk","1 bay leaf ","½ onion","3 cloves","1 tsp allspice berries"],
    "recipe": "1. For the infused milk, pour the milk into a saucepan and add the bay leaf, onion, cloves and allspice. Bring almost to the boil then remove from the heat and leave to infuse and cool.\n2. Bring a large saucepan of salted water to the boil. Add the macaroni and cook for 6–7 minutes, or until just shy of al dente. Drain. \n3. Meanwhile, make the sauce. Heat the butter in a large saucepan. Add the onion and cook until soft and translucent. Turn up the heat and let the onion brown a little. Add the garlic and thyme and cook for a further 2 minutes. Stir in the flour until you have a roux (it will be lumpy because of the onion). Pour in the wine. Stir to form a thick paste and gradually add the milk, stirring between each addition, until it is all incorporated and there is a smooth béchamel sauce. Pour in the chicken stock and stir in the chipotle paste.\n4. Preheat the oven to 220C/200C Fan/Gas 7.\n5. Mix the smoked and mature cheddars together in a small bowl and add two thirds of the cheese to the sauce. Stir until the cheese is melted into the sauce and then add the macaroni. Stir to combine and transfer to a large baking dish. Sprinkle with the remaining cheese and bake for 30–35 minutes, until piping hot, browned and bubbling. Serve in warmed bowls. ",
    "photo": "https://ichef.bbci.co.uk/food/ic/food_16x9_1600/recipes/mac_and_cheese_30155_16x9.jpg",
    "isVegan": false,
    "isVegetarian": false,
    "preparationTime": 25,
    "cookingTime": 45,
    "createdOn": "2021-01-26",
    "cuisineId": "american"
  },
  {
    "name": "Vegetarian haggis",
    "tags": ["dinner"],
    "ingredients": ["60g/1¼oz yellow split peas (soaked overnight in the fridge and drained)","60g/1¼oz pearl barley","60g/1¼oz butter, plus extra for greasing","2 carrots, peeled and finely diced","100g/3½oz chestnut mushrooms, finely chopped ","1 large onion, finely diced","100g/3½oz porridge oats","½ tsp ground coriander ","1 tsp ground black pepper, plus extra for seasoning","1 tsp ground allspice","500ml/18fl oz vegetable stock","2 tbsp treacle","1 tbsp yeast extract ","salt and freshly ground black pepper"],
    "recipe": "1. Bring two large saucepans of lightly salted water to the boil. Add the split peas to one pan and the pearl barley to the other. Cook for about 40 minutes or until soft. Drain and set aside. \n2. Melt half of the butter in a large non-stick frying pan and fry the carrot, mushroom and onion until soft and fragrant. Add the oats, cooked split peas, remaining butter, coriander, black pepper and allspice and fry until fragrant. Add the stock, treacle, yeast extract and a pinch of salt. Cook over a medium–high heat  for about 15 minutes until everything has thickened. Stir in the cooked pearl barley and season with salt and pepper.\n3. Preheat the oven to 190C/170C Fan/Gas 5. \n4. Line a rectangular loaf tin with baking paper or grease with butter. Add the haggis mixture to the tin, cover with kitchen foil and bake for 30 minutes. Remove the foil and cook for another 30 minutes. Leave to cool for about 5–10 minutes in the tin, then cut into slices and serve immediately.",
    "photo": "https://ichef.bbci.co.uk/food/ic/food_16x9_1600/recipes/vegetarian_haggis_94965_16x9.jpg",
    "isVegan": false,
    "isVegetarian": true,
    "preparationTime": 500,
    "cookingTime": 90,
    "createdOn": "2022-01-11",
    "cuisineId": "british"
  },
  {
    "name": "Broccoli and cauliflower soup",
    "tags": ["soup"],
    "ingredients": ["1 tbsp olive oil","200g/7oz cauliflower florets (approx. ½ small cauliflower)","½ tsp cumin seeds","freshly ground sea salt and black pepper","1 brown onion, roughly chopped","2 large garlic cloves, minced","1.2 litres/2 pints vegetable stock","400g/14oz broccoli florets (approx. 1 small head broccoli, stem included)"],
    "recipe": "1. Preheat the oven to 200C/180C Fan/Gas 6. Toss the cauliflower florets with ½ a tablespoon of olive oil, the cumin seeds and a generous amount of salt and pepper. Roast for 15 minutes on a baking tray until the florets are just starting to char.\n2. Heat the remaining ½ tablespoon of oil in a large lidded saucepan over a medium heat. Gently fry the onion with a pinch of salt for 8–10 minutes until the onion is soft and slightly golden. Add the garlic to the pan and cook for a further minute until aromatic. \n3. Add the cooked cauliflower florets to the pan, as well as any cumin seeds left on the tray. Then add the vegetable stock and the broccoli, turn up the heat and bring the soup to the boil, before reducing to a gentle simmer. Simmer with the lid on for 15–20 minutes until the broccoli and cauliflower are both tender.\n4. Using a stick blender, blitz the soup until smooth. Check the seasoning and serve.",
    "photo": "https://ichef.bbci.co.uk/food/ic/food_16x9_1600/recipes/broccoli_and_cauliflower_35959_16x9.jpg",
    "isVegan": true,
    "isVegetarian": true,
    "preparationTime": 25,
    "cookingTime": 45,
    "createdOn": "2021-09-15",
    "cuisineId": "british"
  },
  {
    "name": "Vegetarian Singapore fried noodles",
    "tags": ["noodles", "dinner"],
    "ingredients": ["100g/3½oz dried rice vermicelli noodles","½ medium red onion, finely sliced","1 large carrot, peeled and cut into thin matchsticks","1 small leek, or 3 spring onions, trimmed and cut into thin matchsticks","3 leaves Chinese leaf, green cabbage or spring greens, trimmed and thinly shredded","1 tbsp sunflower or vegetable oil","fresh chives or sliced spring onions and sliced red chilli, to serve"],
    "recipe": "1. Put the noodles in a large bowl and cover with just-boiled water. Leave to stand for 2 minutes, then drain in a sieve and spread out onto a clean tea towel. Pat and press until as dry as possible, then transfer to a bowl. (If you have time, leave the noodles to dry on a second clean tea towel for 10–15 minutes before putting in the bowl – this will help them stay al dente and separate as they cook.)\n2. Mix all the ingredients for the curry paste in a small bowl until thoroughly combined.\n3. Place the prepared vegetables in a semi-circle on a board or plate, starting with the onion and ending with the shredded leaves. Arrange the bowl of noodles and the paste below to give a ‘wheel’ of ingredients.\n4. Heat ½ tbsp of the oil in a wok over a very high heat. Add the red onion and stir-fry for 10–15 seconds, then add the carrot and stir-fry for 10 seconds more. Add the leek and stir-fry for a further 10 seconds before adding a little more oil and the leaves. Stir-fry for 10–15 seconds more. Move all the vegetables to the sides of the wok, leaving the centre clear.\n5. Add another teaspoon of oil, wait for the wok to be smoking hot, then toss the noodles in the middle. Fry for a few seconds, then bring the vegetables from the sides onto the noodles and stir-fry together for about 1 minute.\n6. Finally, add the curry paste and stir-fry with the noodles and vegetables for 20–30 seconds more. Divide between two warmed bowls, scatter over chives or spring onions and red chilli to serve.",
    "photo": "https://ichef.bbci.co.uk/food/ic/food_16x9_1600/recipes/vegan_singapore_noodles_62023_16x9.jpg",
    "isVegan": false,
    "isVegetarian": true,
    "preparationTime": 25,
    "cookingTime": 10,
    "createdOn": "2021-12-15",
    "cuisineId": "chinese"
  },
  {
    "name": "Hoisin salmon noodles ",
    "tags": ["dinner", "noodles", "fish"],
    "ingredients": ["4 x 125g/4oz salmon fillets, with skin left on","2 heaped tbsp hoisin sauce (from a jar or bottle)","150g/5½oz cherry tomatoes, halved","140g/5oz medium egg noodles","200g/7oz long-stemmed broccoli, trimmed ","freshly ground black pepper","dark soy sauce, to serve (optional)"],
    "recipe": "1. Preheat the oven to 220C/200C Fan/Gas 7 and line a small, shallow ovenproof dish with kitchen foil. \n2. Place the salmon fillets into the dish, skin-side down, and brush generously with the hoisin sauce. Make sure the fillets are placed at least 5cm/2in apart from each other. Scatter the cherry tomatoes around them. Cook for 15 minutes, or until the salmon is cooked through. \n3. Meanwhile, prepare the noodles. Half-fill a saucepan with water and bring to the boil. Add the noodles, return to the boil and cook for 1 minute, stirring to separate the strands. Add the broccoli and cook for 3 more minutes, stirring occasionally.\n4. Divide the noodles and broccoli between four warmed plates. Top with the salmon fillets and scatter with the cherry tomatoes. Season with pepper and serve sprinkled with a little soy sauce, if using.  ",
    "photo": "https://ichef.bbci.co.uk/food/ic/food_16x9_1600/recipes/hoisin_salmon_with_44468_16x9.jpg",
    "isVegan": false,
    "isVegetarian": false,
    "preparationTime": 25,
    "cookingTime": 20,
    "createdOn": "2022-01-02",
    "cuisineId": "chinese"
  },
  {
    "name":"Easy vegetable stir-fry",
    "tags": ["dinner", "noodles"],
    "ingredients": ["2 x 350g bags diced butternut squash and sweet potato mix","1 tbsp vegetable oil","about 250g/9oz black bean stir-fry sauce (brands vary)","2 tbsp sesame seeds","2 tsp sesame oil","200g/7oz sugar-snap peas","3 x 150g packs straight-to-wok medium or thick noodles, heated according to the packet instructions"],
    "recipe": "1. Tip the diced vegetables and vegetable oil into a large wok. Fry over a high heat, stirring, for about 5 minutes, until the vegetables begin to take on some colour. Add the sauce with 300ml/½ pint water and leave to bubble, stirring occasionally, for 12–15 minutes, until the sauce has reduced and the vegetables are cooked through. \n2. Meanwhile, tip the sesame seeds into a frying pan and toast until golden brown, then tip into a bowl to stop them cooking further. \n3. Heat the sesame oil in the sesame seed frying pan, add the sugar-snap peas and stir-fry for 1 minute. \n4. Add the noodles to the vegetable mixture and use tongs to mix them through as they heat up. Tip in the sugar-snap peas and most of the sesame seeds, stir through, then divide between plates. Scatter the rest of the sesame seeds over the top and serve.",
    "photo": "https://ichef.bbci.co.uk/food/ic/food_16x9_1600/recipes/sachas_stir-fry_17077_16x9.jpg",
    "isVegan": false,
    "isVegetarian": true,
    "preparationTime": 25,
    "cookingTime": 20,
    "createdOn": "2022-01-01",
    "cuisineId": "chinese"
  },
  {
    "name":"Pierogi",
    "tags": ["lunch", "dinner", "snack"],
    "ingredients": [
      "50g/2oz dried mushrooms",
      "250g/9oz ready-made sauerkraut (available in jars from larger supermarkets)",
      "40g/1½oz butter",
      "250g/9oz floury potatoes, such as Maris Piper, cut into pieces",
      "3 tbsp olive oil",
      "1 medium onion, finely diced",
      "250g/9oz half-fat cottage cheese",
      "250g/9oz self-raising flour, plus extra for dusting",
      "1 tsp salt",
      "1 tbsp vegetable oil",
      "150ml/5fl oz warm water",
      "300ml/10½fl oz soured cream",
      "small handful fresh dill, to garnish"
    ],
    "recipe": "1. For the mushroom and sauerkraut filling, soak the dried mushrooms in 300ml/10½fl oz water and set aside to infuse for 1 hour.\n2. Drain the sauerkraut in a colander and rinse under a tap to remove some of the acidity. Transfer to a pan of boiling water. Reduce the heat until the water is simmering and cook the sauerkraut for 30 minutes. Drain well.\n3. Remove the mushrooms from the water using a slotted spoon, reserving the water. Finely chop the mushrooms.\n4. Heat the butter in a frying pan over a medium heat. Add the sauerkraut, mushrooms and the reserved water. Bring the mixture to the boil. Continue to boil the mixture until all of the liquid has evaporated, then remove from the heat and set aside until cool.\n5. For the cottage cheese and potato filling, boil the potatoes in a pan of salted water until soft enough to mash (about 20 minutes). Drain well and set aside to cool.\n6. Heat the oil in a frying pan over a medium heat and fry the onions for 4-5 minutes, or until crisp and browned. Reserve a tablespoonful of the onions for the garnish. \n7. For the dumpling dough, sift the flour into a large mixing bowl and make a well in the centre. Fill the well with the salt, oil and water. Using your fingers, gradually stir the flour into the wet ingredients, until the mixture comes together as a soft dough.\n8. Turn the dough out onto a lightly floured work surface and knead for 5-8 minutes, or until it is smooth and glossy. Wrap the dough in a clean tea towel and set aside to rest in a cool room for at least 20 minutes.\n9. When the potatoes have cooled, transfer them to a large bowl and crumble over the cottage cheese. Mash until smooth, then stir in the fried onions until well combined. Set aside.\n10. To shape the pierogi, roll out the dough onto a lightly floured surface to a thickness of 3mm. Cut 10cm/4in rounds from it using a pastry cutter.\n11. Place one teaspoonful of the cottage cheese and potato filling into half of the pastry rounds, and one teaspoonsful of the mushroom and sauerkraut filling into the remaining pastry rounds. Brush a little water around the edge of each pastry round, then fold the edges together to create a bulging semi-circular dumpling, pressing the edges together to seal.\n12. Poach the pierogi, in batches if necessary, in a deep-sided pan of boiling water for 3-4 minutes, or until they float to the surface.\n13. To serve, pile the pierogi onto serving plates and serve the soured cream in small bowls alongside. Sprinkle with the reserved fried onions and the dill.",
    "photo": "https://ichef.bbci.co.uk/food/ic/food_16x9_1600/recipes/rafaels_pierogi_93244_16x9.jpg",
    "isVegan": false,
    "isVegetarian": true,
    "preparationTime": 90,
    "cookingTime": 45,
    "createdOn": "2020-03-31",
    "cuisineId": "east_european"
  },
  {
    "name":"Classic lemon tart",
    "tags": ["dessert"],
    "ingredients": ["5 free-range eggs","190g/6¾oz caster sugar","250ml/9fl oz double cream","4 lemons, juice and zest","butter, for greasing","flour, for dusting","225g/8oz ready-made sweet shortcrust pastry","icing sugar, for dusting"],
    "recipe": "1. Preheat the oven to 200C/400F/Gas 6.\n2. For the lemon tart, crack the eggs into a bowl and whisk gently to break up the yolks. Add the sugar and mix well. Add the cream and the lemon juice and stir. Pass the mixture through a sieve, then add the lemon zest and set aside.  \n3. Grease a 20cm/8in flan ring with butter. Roll out the pastry on a lightly floured surface to make a circle large enough to fit over the flan ring. Using the rolling pin, carefully lift the pastry over the ring and gently press into the ring. Allow the pastry to overhang the edges of the ring slightly. Line with a circle of greaseproof paper and fill with rice or baking beans.\n4. Transfer to the oven and bake for about 15 minutes. Remove from the oven and remove the beans and greaseproof paper, then return to the oven for five minutes, or until the tart case is lightly browned.\n5. Turn the oven down to 150C/300F/Gas 2 and pour the lemon mixture into the tart case. Bake in the oven for about an hour, or until the filling is just set and the pastry is golden-brown.\n6. Remove the tart from the oven and trim off the edges of the pastry. Leave to cool completely, then place in the fridge to chill for about two hours.\n7. Preheat the grill to medium. Dust the top of the tart generously with icing sugar then place under the grill until caramelised.\n8. For the goats' cheese cream, place the goats' cheese into a bowl with the cream and icing sugar and mix well.\n9. To serve, cut the tart into wedges and serve with a spoonful of the goats' cheese cream.",
    "photo": "https://ichef.bbci.co.uk/food/ic/food_16x9_1600/recipes/classiclemontart_86198_16x9.jpg",
    "isVegan": false,
    "isVegetarian": true,
    "preparationTime": 125,
    "cookingTime": 90,
    "createdOn": "2020-07-21",
    "cuisineId": "french"
  },
  {
    "name":"Watermelon and feta salad",
    "tags": ["salad", "lunch"],
    "ingredients": ["1 red onion, thinly sliced","2 tbsp red wine vinegar","½ tbsp honey","3 tbsp extra virgin olive oil","½ watermelon (or 1 small watermelon), approx. 1.6kg/3lb 8oz","1 cucumber, peeled","½ bunch fresh mint, leaves roughly chopped","200g/7oz feta, crumbled","sea salt and freshly ground black pepper"],
    "recipe": "1. Put the onion in a large mixing bowl, add the vinegar and leave for 10 minutes. \n2. Whisk in the honey and olive oil and season generously. \n3. Peel the watermelon and cut into 2–3cm/approx 1in pieces, discarding any obvious pips (it doesn’t matter if you miss a few). Cut the cucumber into slightly smaller pieces. Add them both to the bowl with the dressing, then add the mint and the feta. Mix everything together and serve straight away.",
    "photo": "https://ichef.bbci.co.uk/food/ic/food_16x9_1600/recipes/watermelonandfetasal_86516_16x9.jpg",
    "isVegan": false,
    "isVegetarian": true,
    "preparationTime": 25,
    "cookingTime": 0,
    "createdOn": "2020-11-11",
    "cuisineId": "greek"
  },
  {
    "name":"Vegan moussaka",
    "tags": ["baked", "dinner"],
    "ingredients": ["4 tbsp olive oil, plus extra for greasing","1 small aubergine (around 250g/9oz), cut into roughly 1cm/½in slices","1 large courgette (around 225g/8oz), trimmed and cut into roughly 1cm/½in slices","2 sweet potatoes (each around 225g/8oz), peeled and cut into roughly 1cm/½in slices","1 onion, finely chopped","150g/5½oz chestnut mushrooms, roughly chopped","2 garlic cloves, crushed","75g/2⅔oz red lentils","400g tin chopped tomatoes","2 tbsp tomato purée","½ tsp dried mint","½ tsp ground cinnamon","1 vegan vegetable stock cube","salt and freshly ground black pepper"],
    "recipe": "1. Preheat the oven to 220C/200C Fan/Gas 7. Use a tablespoon of the oil to generously grease a large baking tray. Place the sliced aubergine and courgette in a single layer on the tray and brush with a tablespoon more oil. Season with ground black pepper. Roast in the oven for 10–12 minutes, or until softened and lightly browned.  \n2. Fill a medium saucepan two-thirds full with water and bring to the boil. Add the sweet potato slices and return to the boil. Cook for 3–4 minutes, or until just tender. Drain in a colander and set aside.\n3. Heat the remaining 2 tablespoons of olive oil in a large, non-stick saucepan and fry the onion and mushroom over a high heat for 3–4 minutes, or until softened and beginning to brown, stirring. Add the garlic and cook for a few seconds more.\n4. Stir in the red lentils, tomatoes, tomato purée, mint, cinnamon and crumbled stock cube. Refill the tomato tin with water (around 400ml/14fl oz) and pour into the pan. Stir well, bring to a simmer and cook for 12–15 minutes, or until the lentils are tender and the sauce is thick, stirring regularly. \n5. While the vegetables are simmering, make the white sauce. Put the flour, almond milk, yeast, bay leaf and nutmeg in a medium saucepan and season well with salt and pepper. \n6. Bring to a simmer, whisking constantly with a metal whisk over a moderate heat for 4–5 minutes, or until smooth and thickened. (Use a silicone-covered whisk if using a non-stick saucepan.) Add the vegan ‘mozzarella’ and cook for 1–2 minutes more, stirring. Adjust the seasoning to taste.\n7. Arrange the sliced potatoes over the base of a well-oiled 1.25 litre/2 pint baking dish (a lasagne dish is ideal). Spread with half of the lentil mixture. Top with the aubergine and courgette slices, then add the rest of the lentil mixture, spreading to the sides of the dish.\n8. Remove the bay leaf from the white sauce and pour the sauce over the lentils and veg. \n9. Bake for 20–25 minutes, or until the topping is lightly browned and bubbling. Stand for 5–10 minutes before cutting to allow the filling to settle. Serve.",
    "photo": "https://ichef.bbci.co.uk/food/ic/food_16x9_1600/recipes/vegan_moussaka_52413_16x9.jpg",
    "isVegan": true,
    "isVegetarian": true,
    "preparationTime": 25,
    "cookingTime": 45,
    "createdOn": "2020-09-22",
    "cuisineId": "greek"
  },
  {
    "name":"Palak paneer",
    "tags": ["dinner", "rice"],
    "ingredients": ["500g/1lb 2oz spinach","500ml/18fl oz boiling water","3 tsp cornmeal or fine polenta","4 tsp ghee or 6 tsp sunflower or rapeseed oil","400g/14oz paneer, cut into chunks","1 tsp cumin seeds ","20g/¾oz fresh root ginger, peeled and grated ","20g/¾oz garlic, finely chopped","125g/4½oz onion, finely chopped ","2–3 small green chillies, seeds in (bird’s eye or similar), chopped","1 tsp ground turmeric ","2 tsp garam masala ","1 tsp salt "],
    "recipe": "1. Tip the spinach into a saucepan and pour over the water. Bring to the boil and cook for 4–5 minutes until tender. Drain, reserving 50ml/2fl oz of the cooking water. Transfer the cooked spinach to a bowl. \n2. Add the cornmeal to the cooked spinach, along with the reserved water. Blend to a smooth purée with a stick blender. Set aside. \n3. Heat 2 teaspoons of the ghee or oil in pan over a medium heat, then fry the paneer chunks until evenly browned on all sides. Transfer to a plate and set aside.\n4. In the same pan, heat the remaining ghee or oil, then add the cumin seeds. As soon as they begin to sizzle, add the ginger and garlic and cook for 1 minute. Add the onion and chillies and cook for another 7–8 minutes on a medium heat until the onions are softened.\n5. Stir in the turmeric, garam masala and salt and cook for 1 minute more. Stir in the puréed spinach, lower the heat and cover the pan. Cook for another 4 minutes, then add the cooked paneer and cook for a further 2 minutes. \n6. Serve hot with a flatbread or plain rice.",
    "photo": "https://ichef.bbci.co.uk/food/ic/food_16x9_1600/recipes/palak_paneer_85769_16x9.jpg",
    "isVegan": false,
    "isVegetarian": true,
    "preparationTime": 25,
    "cookingTime": 20,
    "createdOn": "2020-02-28",
    "cuisineId": "indian"
  },
  {
    "name":"Prawn spaghetti with tomato, basil and chilli",
    "tags": ["seafood", "dinner"],
    "ingredients": ["1 tbsp olive oil","200g/7oz raw king prawns, deveined","2 garlic cloves, thinly sliced","1 small Scotch bonnet chilli, deseeded and finely chopped, or a pinch of dried chilli flakes","1 tbsp tomato purée ","400g tin chopped tomatoes","175g/6oz wholewheat spaghetti ","large bunch basil, leaves roughly torn"],
    "recipe": "1. Heat half the oil in a deep frying pan over a high heat. Add the prawns and half the garlic. Fry for 2–3 minutes or until the prawns turn pink. Tip onto a plate and set aside.\n2. Reduce the heat to medium. Add the remaining oil, the rest of the garlic and the chilli. Fry for 2 minutes. Add the tomato purée and chopped tomatoes, bring to the boil, then reduce the heat to a gentle simmer and cook for 15 minutes. \n3. Meanwhile, cook the pasta in a pan of salted water according to the packet instructions. \n4. Drain the pasta, reserving the cooking water. Add the pasta to the sauce with a ladleful of the reserved cooking water and toss together to coat the pasta. Return the prawns to the pan, add the basil and toss everything together.",
    "photo": "https://ichef.bbci.co.uk/food/ic/food_16x9_1600/recipes/prawn_spaghetti_with_13071_16x9.jpg",
    "isVegan": false,
    "isVegetarian": false,
    "preparationTime": 25,
    "cookingTime": 20,
    "createdOn": "2021-01-02",
    "cuisineId": "italian"
  },
  {
    "name": "Chicken pesto pasta",
    "tags": ["dinner", "pasta"],
    "ingredients": ["2 chicken breasts, approx. 120g/4½oz each","6–8 tbsp olive oil, plus extra for drizzling","1 onion, peeled and cut in half (optional)","1 carrot (optional)","1 garlic clove","1 tbsp pine nuts","45 basil leaves","20g/¾oz pecorino, grated","20g/¾oz Parmesan, grated","450g/1lb dried pasta","salt, to season"],
    "recipe": "1. Preheat the oven to 220C/200C Fan/Gas7. \n2. Drizzle the chicken breasts with olive oil, season and wrap in kitchen foil. Bake in the oven for around 15–16 minutes until cooked through. (Note that if the chicken breast is larger than specified, it may take longer to cook. A 150–200g/5½–7oz skinless chicken breast fillet will need 16–18 minutes; a 200–250g/7–9oz one 18–20 minutes; and a 250–300g/9–10½ one 20–22 minutes. If cooking more than four breasts at a time, increase the cooking time by 5 minutes, and don’t forget to check that each breast is cooked through.) Alternatively you can poach the chicken – place the chicken in a pan along with the peeled onion and carrot and cover with 2.5cm/1in cold water. Bring to a simmer, add a good pinch of salt and poach for 10–15 minutes, with a lid on, until the chicken is completely cooked.\n3. While the chicken is cooking, make the pesto. If you are using a pestle and mortar, start by pounding the garlic and salt to a rough paste, then add the pine nuts, then basil, then oil, and pound to a consistency you like. Stir in the cheese to finish. If you are working in a food processor you can blend the garlic, salt, pine nuts, basil and oil all together, and once you have a consistency you like, stir in the cheese.\n4. Once the chicken is cooked, let it rest until cool enough to handle, then shred into a large mixing bowl and toss gently with the pesto.\n5. Bring a large pan of salted water to the boil, and boil the pasta until al dente. Drain the pasta, saving a cup of pasta cooking water. Combine the pasta with the chicken and pesto, and toss together, adding a bit of pasta water if it needs loosening. Serve.",
    "photo": "https://ichef.bbci.co.uk/food/ic/food_16x9_1600/recipes/chicken_pesto_pasta_68085_16x9.jpg",
    "isVegan": false,
    "isVegetarian": false,
    "preparationTime": 25,
    "cookingTime": 20,
    "createdOn": "2022-01-11",
    "cuisineId": "italian"
  },
  {
    "name": "Chicken teriyaki",
    "tags": ["dinner", "noodles"],
    "ingredients": ["4 chicken thighs","30ml/2 tbsp honey","60ml/4 tbsp soy sauce","60ml/4 tbsp mirin","30ml/2 tbsp sake","2 tsp grated fresh root ginger","1 garlic clove, chopped","30ml/2 tbsp vegetable oil","250g/9oz medium egg noodles"],
    "recipe": "1. Remove the bones from the chicken thighs using a small, sharp knife.\n2. In a large bowl, mix together the honey, soy sauce, mirin, sake, ginger and garlic. \n3. Place the chicken thighs in the marinade and cover the meat thoroughly with the sauce. Transfer the chicken to the fridge for 15 minutes. \n4. When ready to cook the chicken, heat the vegetable oil in a frying pan. Dry the skin side of the chicken thighs on some kitchen paper, so the skin will crisp up when fried. Place the chicken thighs in the frying pan, skin side down, over a medium heat.  Fry until the skin is browned. Depending on the size of your frying pan, you may need to fry the chicken in batches - don't crowd the pan. \n5. Turn down the heat to low, then turn the chicken over to fry the other side. Pour the sauce used to marinate the chicken into the pan. Simmer on a low heat for five minutes, then increase the temperature and cook until the sauce becomes thick. \n6. Meanwhile, cook the noodles according to packet instructions.\n7. To serve, slice the chicken and place on a plate with the noodles. Pour the thickened teriyaki sauce over the chicken. ",
    "photo": "https://ichef.bbci.co.uk/food/ic/food_16x9_1600/recipes/how_to_make_chicken_71312_16x9.jpg",
    "isVegan": false,
    "isVegetarian": false,
    "preparationTime": 25,
    "cookingTime": 20,
    "createdOn": "2022-01-11",
    "cuisineId": "japanese"
  },
  {
    "name": "Vegan quesadilla",
    "tags": ["dinner", "snack"],
    "ingredients": ["1 large sweet potato (approx. 250g/9oz)","½ tsp fajita seasoning or Tex-Mex spice blend (or ½ tsp ground cumin)","2 spring onions, thinly sliced","2 large flour or corn tortilla wraps ","75g/2¾oz frozen sweetcorn, defrosted, or half a 198g tin, drained","75g/2¾oz mature cheddar-style dairy-free cheese, grated","salt and freshly ground black pepper","sliced jalapeño chillies, to serve (optional)"],
    "recipe": "1. Prick the sweet potato all over with a fork, put in a microwave-safe bowl and loosely cover with a lid. Cook on High for 8 minutes, then for 1 minute at a time, until soft in the centre.\n2. Handling carefully, as the potato will be hot, cut in half and scoop the flesh into a bowl. Add the spice mix and some salt and pepper and mash well. Stir through the spring onions.\n3. Lay one tortilla on a board and spread over the sweet potato mixture. Scatter with the sweetcorn and cheese and cover with the second tortilla. \n4. Lift into a large frying pan and cook over a low–medium heat for about 2 minutes until the underside is golden and crisp. If it’s browning too quickly, turn the heat down, or the fillings won’t heat through before the tortilla is done. Flip and repeat on the other side. \n5. Tip out of the pan back onto the board and slice into wedges. Serve with jalapeños if you like it spicy.",
    "photo": "https://ichef.bbci.co.uk/food/ic/food_16x9_1600/recipes/vegan_quesadilla_17979_16x9.jpg",
    "isVegan": true,
    "isVegetarian": true,
    "preparationTime": 25,
    "cookingTime": 20,
    "createdOn": "2021-02-21",
    "cuisineId": "mexican"
  },
  {
    "name": "Huevos rancheros",
    "tags": ["breakfast", "brunch"],
    "ingredients": ["3 kale leaves, finely chopped","1 onion, finely chopped","1 green pepper, finely chopped","1 red pepper, finely chopped","1 small bird's eye chilli, finely chopped","1 courgette, finely chopped","1 garlic clove, finely chopped","150ml/5fl oz tomato passata","1 tbsp olive oil","knob of butter","8 free-range eggs","salt and freshly ground black pepper", "handful fresh coriander leaves", "2 soft corn or flour tortillas, warmed in the oven", "hot chilli sauce"],
    "recipe": "1. To make the salsa, put the kale, onion, peppers, chilli, courgette, garlic and passata into a bowl. Season with salt and pepper and mix well.\n2. Heat the oil in a medium lidded frying pan over a medium heat and add a quarter of the salsa. Stir to warm through, then make a hole in the middle of the sauce. Place the butter in the clear area in the middle of the pan, then break 2 eggs into this space.\n3. Put the lid on the pan and cook for 3-4 minutes. The dish is ready when the eggs are cooked into the salsa and the whites are firm. Slide the eggs and sauce onto a large plate and keep warm as you repeat this process three more times.\n4. To serve, sprinkle each dish with coriander leaves and serve the warm tortillas and chilli sauce alongside.",
    "photo": "https://ichef.bbci.co.uk/food/ic/food_16x9_1600/recipes/huevosrancherosranch_84543_16x9.jpg",
    "isVegan": false,
    "isVegetarian": true,
    "preparationTime": 25,
    "cookingTime": 20,
    "createdOn": "2022-01-11",
    "cuisineId": "mexican"
  },
  {
    "name": "Vegetarian paella",
    "tags": ["dinner", "rice"],
    "ingredients": ["4 tbsp vegetable oil","3 red onions, finely sliced","2 garlic cloves, crushed","400g/14oz Calasparra rice","1 tsp ground turmeric","1 tsp smoked paprika","800ml/1 pint 7fl oz hot vegetable stock","1 tsp finely chopped fresh rosemary","200g/7oz cherry tomatoes","150g/5½oz fresh peas","125ml/4fl oz good quality extra virgin olive oil, preferably Spanish","1 tbsp chopped fresh parsley, to serve","1 x 400g/14oz can artichoke hearts in water, drained and rinsed"],
    "recipe": "1. In a frying pan, heat one tablespoon of the vegetable oil over a medium heat. Add the onions and garlic and fry for 2-3 minutes, or until softened.\n2. Add the paella rice, ground turmeric and smoked paprika and stir well to coat the vegetables in the spices.\n3. Add the hot stock and chopped rosemary and bring the mixture to the boil, stirring well. Reduce the heat to a simmer and simmer the mixture, stirring occasionally, for 18-20 minutes, or until the paella rice has absorbed most of the liquid.\n4. Add the cherry tomatoes and peas and continue to simmer for a further 4-5 minutes, or until the rice is just tender.\n5. Remove the pan from the heat and drizzle over the olive oil, then stir until well combined. Stir in the chopped parsley. \n6. Meanwhile, heat a griddle pan over a medium heat. Rub the drained artichokes all over in the remaining three tablespoons of vegetable oil. When the pan is hot, add the oiled artichoke hearts and griddle for 1-2 minutes on each side, or until golden-brown griddle marks appear on both sides (NB: Do not stir the artichoke hearts as you griddle them).\n7. To serve, spoon the paella into the centre of four serving plates. Place some of the griddled artichokes on top of each serving.",
    "photo": "https://ichef.bbci.co.uk/food/ic/food_16x9_1600/recipes/griddledartichokeand_91479_16x9.jpg",
    "isVegan": false,
    "isVegetarian": true,
    "preparationTime": 25,
    "cookingTime": 20,
    "createdOn": "2022-01-04",
    "cuisineId": "spanish"
  },
  {
    "name": "Patatas bravas",
    "tags": ["snack"],
    "ingredients": ["600g/1lb 5oz potatoes - either Maris Piper, Desiree or King Edwards","2 tbsp olive oil","salt and freshly ground black pepper","2 x 410g tins chopped tomatoes","3 red chillies","4 cloves garlic, crushed","chopped parsley, to serve"],
    "recipe": "1. Preheat the oven to 225C/450F/Gas 7.\n2. Peel the potatoes and cut into 2.5cm/1in cubes. \n3. Heat the olive oil in a large roasting tin until really hot. Place the potatoes in the tin and shake them in the oil until covered. Season well with salt and freshly ground black pepper. Place in the hot oven for about ten minutes until they begin to turn golden-brown.\n4. Add the tomatoes, chilli and garlic and stir well. Cook for another 25-35 minutes until the potatoes are soft on the inside and are crisp on the outside. \n5. You can either add the parsley and serve, or refrigerate them until the next day, then reheat, adding more oil and then add the parsley before eating.",
    "photo": "https://ichef.bbci.co.uk/food/ic/food_16x9_1600/recipes/patatabravas_81525_16x9.jpg",
    "isVegan": false,
    "isVegetarian": true,
    "preparationTime": 25,
    "cookingTime": 45,
    "createdOn": "2022-01-04",
    "cuisineId": "spanish"
  },
  {
    "name": "Vegetable Thai red curry",
    "tags": ["dinner"],
    "ingredients": ["250g/9oz glutinous (sticky) rice (available from Asian greengrocers)", "4 small red onions, peeled and roughly chopped", "16 garlic cloves, peeled", "12 stalks lemongrass, outer leaves removed, core roughly chopped", "8 long red chillies, stems removed",
    "8 tbsp chopped fresh coriander (roots and leaves)", "8 tsp chilli powder", "10cm/4in piece fresh galangal, peeled", "4 tsp grated lime zest", "4 fresh lime leaves", "4 tsp shrimp paste (optional)", "12 tsp hot paprika", "8 tsp ground turmeric",
    "2 tsp cumin seeds", "10 tbsp vegetable oil", "1 large leek, trimmed, thinly sliced", "2 garlic cloves, crushed to a paste", "1 large red chilli, trimmed, finely chopped", "2 tbsp Thai red curry paste (see above)", "4 fresh lime leaves", "2 carrots, peeled, roughly chopped",
      "400g/14oz canned chopped tomatoes", "400g/14oz coconut milk", "250ml/9fl oz vegetable stock", "I small cauliflower, trimmed, cut into florets", "½ small butternut squash, peeled, seeds removed, flesh cut into 2.5cm/1in pieces", "175g/7oz snake or French beans, trimmed",
      "1 x 225g/8½oz can bamboo shoots, drained", "bunch fresh coriander, chopped", "handful fresh beansprouts, to serve"],
    "recipe": "1. For the sticky rice, before starting to make the curry, soak the sticky rice in cold water for at least 20 minutes, or up to 3 hours.\n2. For the Thai red curry paste, blend all of the Thai red curry paste ingredients to a smooth paste in a food processor.\n3. For the curry, heat one tablespoon of the vegetable oil in a large wok over a high heat. When the oil is smoking, add the leek, garlic and chilli and stir-fry for 3-5 minutes, or until softened but not browned.\n4. Add the two tablespoons of curry paste and fry for 2-3 minutes, stirring well.\n5. Add the lime leaves, carrots and chopped tomatoes, then pour in the coconut milk and vegetable stock, stirring well to combine. Bring the mixture to the boil, then reduce the heat until simmering and continue to simmer, uncovered, for 10 minutes.\n6. Add the cauliflower florets, butternut squash, French beans and bamboo shoots and continue to simmer for 12-15 minutes, or until the butternut squash is tender and the sauce has thickened slightly and reduced in volume.\n7. Meanwhile, to cook the sticky rice, drain the soaked rice and rinse thoroughly. Punch a few holes in a sheet of baking paper and line a metal or bamboo steamer with it. Add the drained rice to the steamer, cover tightly and suspend the steamer over a pan of boiling water for 20 minutes. (Do not allow the bottom of the steamer to touch the surface of the water.)\n8. When the vegetables in the curry are tender and the sauce has thickened, stir in the chopped coriander.\n9. To serve, spoon the sticky rice into bowls, ladle over the vegetable curry and garnish with a few beansprouts.",
    "photo": "https://ichef.bbci.co.uk/food/ic/food_16x9_1600/recipes/thai_vegetable_curry_41763_16x9.jpg",
    "isVegan": false,
    "isVegetarian": false,
    "preparationTime": 90,
    "cookingTime": 20,
    "createdOn": "2022-01-11",
    "cuisineId": "thai"
  }
]
